In [40]:
import pandas as pd              #dataframe operations
import numpy as np               # math operation
import matplotlib.pyplot as plt  # diagrams / plots 
import seaborn as sns

In [41]:
dict1={'name':['ramesh','gangi','reddy',np.nan],
      'age':[23,33,43,np.nan],
      'city':[np.nan,'hyd','bnglr','chennai']}
data1=pd.DataFrame(dict1)

In [42]:
data1.isnull().sum()   # every column has one missing value is there

name    1
age     1
city    1
dtype: int64

In [43]:
data1.isnull().sum()/100/len(data1)

name    0.0025
age     0.0025
city    0.0025
dtype: float64

In [44]:
data1.isnull().sum()*100/len(data1)

name    25.0
age     25.0
city    25.0
dtype: float64

In [45]:
dict2={'name':['ramesh','gangi','reddy',None],
      'age':[23,33,43,None],
      'city':[None,'hyd','bnglr','chennai']}
data2=pd.DataFrame(dict2)
data2

     name   age     city
0  ramesh  23.0     None
1   gangi  33.0      hyd
2   reddy  43.0    bnglr
3    None   NaN  chennai

In [46]:
data2.isnull()

    name    age   city
0  False  False   True
1  False  False  False
2  False  False  False
3   True   True  False

In [47]:
data2.isnull().sum()

name    1
age     1
city    1
dtype: int64

In [48]:
dict3={'name':['ramesh','gangi','reddy','null'],
      'age':[23,33,43,'null'],
      'city':['null','hyd','bnglr','chennai']}
data3=pd.DataFrame(dict3)
data3

     name   age     city
0  ramesh    23     null
1   gangi    33      hyd
2   reddy    43    bnglr
3    null  null  chennai

In [49]:
data3.isnull()

    name    age   city
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [50]:
data3.isnull().sum()

name    0
age     0
city    0
dtype: int64

$ method - 1 $

- fill the missing values with random number:

    dataframe=data1
    
    method name = fillna

In [51]:
data1.fillna(34)

     name   age     city
0  ramesh  23.0       34
1   gangi  33.0      hyd
2   reddy  43.0    bnglr
3      34  34.0  chennai

$ method : 2 $
    
fill the missing values with random number on specific colums

    dataframe=data1
    
    method name = fillna

In [52]:
data1['name'].fillna('teja',inplace=True)
data1

     name   age     city
0  ramesh  23.0      NaN
1   gangi  33.0      hyd
2   reddy  43.0    bnglr
3    teja   NaN  chennai

In [53]:
dict1={'name':['ramesh','gangi','reddy',np.nan],
      'age':[23,33,43,np.nan],
      'city':[np.nan,'hyd','bnglr','chennai']}
data1=pd.DataFrame(dict1)

$ method $

- bfill
- ffill
- pad
- backfill

In [54]:
data1.fillna(method='backfill')
# names index 2 is missed values 
# it will replace by index 3 values
# age index 3 has missedd value
# we dont have index 4 , so the value is nan
# city index 0 has missed value 
# it replace with index 1 value

     name   age     city
0  ramesh  23.0      hyd
1   gangi  33.0      hyd
2   reddy  43.0    bnglr
3     NaN   NaN  chennai

In [55]:
data1.bfill()

     name   age     city
0  ramesh  23.0      hyd
1   gangi  33.0      hyd
2   reddy  43.0    bnglr
3     NaN   NaN  chennai

In [56]:
data1.pad()

     name   age     city
0  ramesh  23.0      NaN
1   gangi  33.0      hyd
2   reddy  43.0    bnglr
3   reddy  43.0  chennai

In [57]:
data1.ffill()

     name   age     city
0  ramesh  23.0      NaN
1   gangi  33.0      hyd
2   reddy  43.0    bnglr
3   reddy  43.0  chennai

- bfill and backfill are same
- pad and ffill are same

$ method 4 $

- mean
- median
- mode

In [58]:
data1

     name   age     city
0  ramesh  23.0      NaN
1   gangi  33.0      hyd
2   reddy  43.0    bnglr
3     NaN   NaN  chennai

In [59]:
age_mean=data1['age'].mean()
age_mean

33.0

In [60]:
data1['age'].fillna(age_mean)  # insted of providing a random number
                               # we are filling with mean data

0    23.0
1    33.0
2    43.0
3    33.0
Name: age, dtype: float64

In [61]:
age_median=data1['age'].median()
age_median

33.0

In [62]:
data1['age'].fillna(age_median)

0    23.0
1    33.0
2    43.0
3    33.0
Name: age, dtype: float64

In [63]:
age_mode=data1['age'].mode()
age_mode

0    23.0
1    33.0
2    43.0
Name: age, dtype: float64

$ KNN imputer $

- knn=k nearest neighbours
    - in the knn imputer instead of tacking mean of all the values 
    - will choose neighbours data
    - will take those mean data

<img jsname="kSDGid" class="bn6k9b" aria-hidden="true" alt="" role="none" src="https://images.saymedia-content.com/.image/t_share/MTgwNzkxMTE5ODk2OTEzMjU2/reciprocal-identities-in-trigonometry-with-examples.png" data-iml="89927.5" style="cursor: default;">

In [71]:
from sklearn.impute import KNNImputer
knn= KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['age']])

array([[23.],
       [33.],
       [43.],
       [33.]])

$ method 6 $

- based on other columns
- some time all the above code will not providing goog justification
- at the time we need to check other columns dependendancy
- most of the time will pick a columns which  have higest co-relation